In [1]:
import pandas as pd
import numpy as np
from datetime import datetime, timedelta

n = 1000
ship_ids = [f"SHIP_{i%12+1}" for i in range(n)]
crane_ids = [f"CRANE_{i%6+1}" for i in range(n)]

arrival_times = [
    datetime.now().replace(hour=np.random.randint(0, 24), 
                           minute=np.random.randint(0, 60),
                           second=np.random.randint(0, 60)) - timedelta(days=np.random.randint(1, 30))
    for _ in range(n)
]

departure_times = [arrival_time + timedelta(hours=np.random.randint(1, 12)) for arrival_time in arrival_times]
cargo_weights = [round(np.random.uniform(1000, 5000), 2) for _ in range(n)]
operation_times = [round(np.random.uniform(60, 240), 2) for _ in range(n)]  # in minutes

df = pd.DataFrame({
    'ship_id': ship_ids,
    'arrival_time': arrival_times,
    'departure_time': departure_times,
    'cargo_weight': cargo_weights,
    'crane_id': crane_ids,
    'operation_time': operation_times
})

df.head()

,ship_id,arrival_time,departure_time,cargo_weight,crane_id,operation_time
0,SHIP_1,2024-11-30 22:17:10.647379,2024-12-01 06:17:10.647379,2529.54,CRANE_1,82.99
1,SHIP_2,2024-11-19 03:33:27.647379,2024-11-19 10:33:27.647379,1376.21,CRANE_2,217.78
2,SHIP_3,2024-12-07 02:45:37.647379,2024-12-07 05:45:37.647379,3832.93,CRANE_3,153.52
3,SHIP_4,2024-11-26 22:50:30.647379,2024-11-27 06:50:30.647379,2369.53,CRANE_4,219.34
4,SHIP_5,2024-12-02 18:31:39.647379,2024-12-02 22:31:39.647379,4466.51,CRANE_5,183.60

asumsi pembuatan dummy data yaitu ship_id berulang, sehingga bisa menunjukkan rata2 operation time untuk setiap ship

In [3]:
df.to_csv('ship_operations_data.csv', sep=',', index=False)

In [4]:
import pandas as pd
import numpy as np
from datetime import datetime, timedelta
df = pd.read_csv("D:/ARSIP/Testing/ship_operations_data.csv")

In [5]:
avg_operation_time_per_ship = df.groupby('ship_id')['operation_time'].mean().reset_index()

In [6]:
avg_operation_time_per_ship

    ship_id  operation_time
0    SHIP_1      149.454524
1   SHIP_10      157.659277
2   SHIP_11      153.953373
3   SHIP_12      144.101446
4    SHIP_2      147.196786
5    SHIP_3      158.225476
6    SHIP_4      160.199286
7    SHIP_5      145.758072
8    SHIP_6      149.062892
9    SHIP_7      152.738193
10   SHIP_8      148.776506
11   SHIP_9      146.944940

In [7]:
#tapi apabila ingin menghitung average dari keseluruhan ship maka
avg_operation = df['operation_time'].mean()

In [8]:
avg_operation

151.18295

In [9]:
avg_operation_time_per_crane = df.groupby('crane_id')['operation_time'].mean().reset_index()

In [10]:
avg_operation_time_per_crane

  crane_id  operation_time
0  CRANE_1      151.086527
1  CRANE_2      147.981916
2  CRANE_3      152.618982
3  CRANE_4      158.936886
4  CRANE_5      149.855723
5  CRANE_6      146.582169

In [11]:
pip install psycopg2

Requirement already satisfied: psycopg2 in c:\users\jovian\anaconda3\lib\site-packages (2.9.10)
Note: you may need to restart the kernel to use updated packages.

In [12]:
from sqlalchemy import create_engine

user = 'postgres'  
password = '******'  
host = 'localhost'  
port = '5432'  
database = 'testing'

In [13]:
engine = create_engine(f'postgresql://{user}:{password}@{host}:{port}/{database}')

In [14]:
avg_operation_time_per_ship.to_sql('avg_operation_time_per_ship', engine, if_exists='replace', index=False)

12

In [15]:
avg_operation_time_per_crane.to_sql('avg_operation_time_per_crane', engine, if_exists='replace', index=False)

6